### Terraform Plan: `dev`
```
module.platform.module.eks.data.aws_region.current: Reading...
module.platform.data.aws_region.current: Reading...
module.platform.module.eks.aws_iam_role.cluster: Refreshing state... [id=platform-sre-demo-dev-eks-cluster-role]
module.platform.module.eks.aws_iam_policy.lb_controller: Refreshing state... [id=arn:aws:iam::936249129410:policy/platform-sre-demo-dev-eks-lb-controller]
module.platform.module.eks.aws_kms_key.eks: Refreshing state... [id=2fb270e1-46ea-41c2-81fd-ae73297d3140]
module.platform.module.vpc.aws_iam_role.flow_logs: Refreshing state... [id=platform-sre-demo-dev-vpc-flow-logs-role]
module.platform.data.aws_caller_identity.current: Reading...
data.aws_eks_cluster.this: Reading...
module.platform.module.vpc.aws_cloudwatch_log_group.flow_logs: Refreshing state... [id=/aws/vpc/platform-sre-demo-dev/flow-logs]
module.platform.module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0b086ff1eb2a441fa]
module.platform.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.platform.module.eks.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.platform.module.vpc.aws_vpc.this: Refreshing state... [id=vpc-000895d38dda84305]
module.platform.module.eks.aws_iam_role.node_group: Refreshing state... [id=platform-sre-demo-dev-eks-node-role]
module.platform.data.aws_caller_identity.current: Read complete after 0s [id=936249129410]
data.aws_eks_cluster_auth.this: Reading...
data.aws_eks_cluster_auth.this: Read complete after 0s [id=platform-sre-demo-dev-eks]
data.aws_eks_cluster.this: Read complete after 0s [id=platform-sre-demo-dev-eks]
module.platform.module.eks.aws_kms_alias.eks: Refreshing state... [id=alias/platform-sre-demo-dev-eks-kms]
module.platform.module.eks.aws_iam_role_policy_attachment.cluster_policy: Refreshing state... [id=platform-sre-demo-dev-eks-cluster-role-20260308221815190400000006]
module.platform.module.eks.aws_iam_role_policy_attachment.cluster_vpc_controller: Refreshing state... [id=platform-sre-demo-dev-eks-cluster-role-20260308221815172100000005]
module.platform.module.eks.aws_iam_role_policy_attachment.node_ecr: Refreshing state... [id=platform-sre-demo-dev-eks-node-role-20260308221815098800000003]
module.platform.module.eks.aws_iam_role_policy_attachment.node_worker: Refreshing state... [id=platform-sre-demo-dev-eks-node-role-20260308221815052000000001]
module.platform.module.eks.aws_iam_role_policy_attachment.node_ssm: Refreshing state... [id=platform-sre-demo-dev-eks-node-role-20260308221815142000000004]
module.platform.module.eks.aws_iam_role_policy_attachment.node_cni: Refreshing state... [id=platform-sre-demo-dev-eks-node-role-20260308221815071500000002]
module.platform.module.vpc.aws_iam_role_policy.flow_logs: Refreshing state... [id=platform-sre-demo-dev-vpc-flow-logs-role:flow-logs-policy]
module.platform.module.vpc.aws_route_table.database: Refreshing state... [id=rtb-046e7ac40fba96971]
module.platform.module.vpc.aws_internet_gateway.this: Refreshing state... [id=igw-0f702b323439d0d2c]
module.platform.module.vpc.aws_subnet.database[0]: Refreshing state... [id=subnet-029be1b577312bd30]
module.platform.module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-01ed493dc65a94f67]
module.platform.module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-003dce8d1eedd3339]
module.platform.module.eks.aws_security_group.cluster: Refreshing state... [id=sg-0f04d7b991b0a04e8]
module.platform.module.vpc.aws_flow_log.this: Refreshing state... [id=fl-078f545b57e241472]
module.platform.module.vpc.aws_subnet.database[1]: Refreshing state... [id=subnet-0137c5c37c37f4fa2]
module.platform.module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-03ffd85ffac85bbee]
module.platform.module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0f38cd6390a23a248]
module.platform.module.eks.aws_security_group.node: Refreshing state... [id=sg-040d0de731b0e6650]
module.platform.module.vpc.aws_route_table.public: Refreshing state... [id=rtb-047535650d0f112d6]
module.platform.module.eks.aws_eks_cluster.this: Refreshing state... [id=platform-sre-demo-dev-eks]
module.platform.module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0dfe7e83bd1d5232d]
module.platform.module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-063a73f663b8dbb25]
module.platform.module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-04debc666116b7dca]
module.platform.module.vpc.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-056ea357323e9bf1c]
module.platform.module.vpc.aws_db_subnet_group.this: Refreshing state... [id=platform-sre-demo-dev-db-subnet-group]
module.platform.module.vpc.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-027a7587089199530]
module.platform.module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0a99b569a37a55b39]
module.platform.module.eks.aws_eks_access_entry.node: Refreshing state... [id=platform-sre-demo-dev-eks:arn:aws:iam::936249129410:role/platform-sre-demo-dev-eks-node-role]
module.platform.module.eks.aws_eks_addon.vpc_cni: Refreshing state... [id=platform-sre-demo-dev-eks:vpc-cni]
module.platform.module.eks.aws_eks_addon.kube_proxy: Refreshing state... [id=platform-sre-demo-dev-eks:kube-proxy]
module.platform.module.eks.aws_iam_openid_connect_provider.eks: Refreshing state... [id=arn:aws:iam::936249129410:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/EE58BD1229BE4A6E7F1C1D7735C8FB3C]
module.platform.module.eks.aws_eks_node_group.default: Refreshing state... [id=platform-sre-demo-dev-eks:platform-sre-demo-dev-eks-default]
module.platform.module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-05315247fee1f2624]
module.platform.module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0a2769587c0fd8778]
module.platform.module.eks.aws_iam_role.lb_controller: Refreshing state... [id=platform-sre-demo-dev-eks-lb-controller]
module.platform.module.eks.aws_eks_addon.coredns: Refreshing state... [id=platform-sre-demo-dev-eks:coredns]
module.platform.module.eks.aws_iam_role_policy_attachment.lb_controller: Refreshing state... [id=platform-sre-demo-dev-eks-lb-controller-2026030822280555120000000a]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.platform.module.app.kubernetes_config_map.app will be created
  + resource "kubernetes_config_map" "app" {
      + data = (known after apply)
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "platform-sre-demo-config"
          + namespace        = "demo"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.platform.module.app.kubernetes_deployment.app will be created
  + resource "kubernetes_deployment" "app" {
      + id               = (known after apply)
      + wait_for_rollout = true

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "app" = "platform-sre-demo"
            }
          + name             = "platform-sre-demo"
          + namespace        = "demo"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + min_ready_seconds         = 0
          + paused                    = false
          + progress_deadline_seconds = 600
          + replicas                  = "1"
          + revision_history_limit    = 10

          + selector {
              + match_labels = {
                  + "app" = "platform-sre-demo"
                }
            }

          + template {
              + metadata {
                  + annotations      = {
                      + "prometheus.io/port"   = "80"
                      + "prometheus.io/scrape" = "true"
                    }
                  + generation       = (known after apply)
                  + labels           = {
                      + "app" = "platform-sre-demo"
                    }
                  + name             = (known after apply)
                  + resource_version = (known after apply)
                  + uid              = (known after apply)
                }
              + spec {
                  + automount_service_account_token  = true
                  + dns_policy                       = "ClusterFirst"
                  + enable_service_links             = true
                  + host_ipc                         = false
                  + host_network                     = false
                  + host_pid                         = false
                  + hostname                         = (known after apply)
                  + node_name                        = (known after apply)
                  + restart_policy                   = "Always"
                  + scheduler_name                   = (known after apply)
                  + service_account_name             = (known after apply)
                  + share_process_namespace          = false
                  + termination_grace_period_seconds = 30

                  + container {
                      + image                      = "nginx:1.25-alpine"
                      + image_pull_policy          = (known after apply)
                      + name                       = "app"
                      + stdin                      = false
                      + stdin_once                 = false
                      + termination_message_path   = "/dev/termination-log"
                      + termination_message_policy = (known after apply)
                      + tty                        = false

                      + env_from {
                          + config_map_ref {
                              + name = "platform-sre-demo-config"
                            }
                        }

                      + liveness_probe {
                          + failure_threshold     = 3
                          + initial_delay_seconds = 10
                          + period_seconds        = 10
                          + success_threshold     = 1
                          + timeout_seconds       = 1

                          + http_get {
                              + path   = "/"
                              + port   = "80"
                              + scheme = "HTTP"
                            }
                        }

                      + port {
                          + container_port = 80
                          + name           = "http"
                          + protocol       = "TCP"
                        }

                      + readiness_probe {
                          + failure_threshold     = 3
                          + initial_delay_seconds = 5
                          + period_seconds        = 5
                          + success_threshold     = 1
                          + timeout_seconds       = 1

                          + http_get {
                              + path   = "/"
                              + port   = "80"
                              + scheme = "HTTP"
                            }
                        }

                      + resources {
                          + limits   = {
                              + "cpu"    = "200m"
                              + "memory" = "128Mi"
                            }
                          + requests = {
                              + "cpu"    = "50m"
                              + "memory" = "64Mi"
                            }
                        }

                      + security_context {
                          + allow_privilege_escalation = false
                          + privileged                 = false
                          + read_only_root_filesystem  = false
                          + run_as_non_root            = false
                        }
                    }
                }
            }
        }
    }

  # module.platform.module.app.kubernetes_namespace.app will be created
  + resource "kubernetes_namespace" "app" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "app"         = "platform-sre-demo"
              + "environment" = "dev"
            }
          + name             = "demo"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.platform.module.app.kubernetes_service.app will be created
  + resource "kubernetes_service" "app" {
      + id                     = (known after apply)
      + status                 = (known after apply)
      + wait_for_load_balancer = true

      + metadata {
          + annotations      = {
              + "service.beta.kubernetes.io/aws-load-balancer-scheme" = "internet-facing"
              + "service.beta.kubernetes.io/aws-load-balancer-type"   = "nlb"
            }
          + generation       = (known after apply)
          + name             = "platform-sre-demo"
          + namespace        = "demo"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + allocate_load_balancer_node_ports = true
          + cluster_ip                        = (known after apply)
          + cluster_ips                       = (known after apply)
          + external_traffic_policy           = (known after apply)
          + health_check_node_port            = (known after apply)
          + internal_traffic_policy           = (known after apply)
          + ip_families                       = (known after apply)
          + ip_family_policy                  = (known after apply)
          + publish_not_ready_addresses       = false
          + selector                          = {
              + "app" = "platform-sre-demo"
            }
          + session_affinity                  = "None"
          + type                              = "LoadBalancer"

          + port {
              + node_port   = (known after apply)
              + port        = 80
              + protocol    = "TCP"
              + target_port = "80"
            }
        }
    }

  # module.platform.module.eks.data.tls_certificate.eks will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "tls_certificate" "eks" {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = "https://oidc.eks.us-east-1.amazonaws.com/id/EE58BD1229BE4A6E7F1C1D7735C8FB3C"
    }

  # module.platform.module.eks.aws_eks_cluster.this will be updated in-place
  ~ resource "aws_eks_cluster" "this" {
        id                            = "platform-sre-demo-dev-eks"
        name                          = "platform-sre-demo-dev-eks"
        tags                          = {
            "Environment" = "dev"
            "ManagedBy"   = "terraform"
            "Project"     = "platform-sre-demo"
            "Repository"  = "sre-assessment"
        }
      ~ version                       = "1.30" -> "1.31"
        # (11 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.platform.module.eks.aws_eks_node_group.default must be replaced
+/- resource "aws_eks_node_group" "default" {
      ~ ami_type               = "AL2_x86_64" -> "AL2023_x86_64_STANDARD" # forces replacement
      ~ arn                    = "arn:aws:eks:us-east-1:936249129410:nodegroup/platform-sre-demo-dev-eks/platform-sre-demo-dev-eks-default/b4ce67c8-49b8-f61b-00c3-cfc3c88e0f36" -> (known after apply)
      ~ id                     = "platform-sre-demo-dev-eks:platform-sre-demo-dev-eks-default" -> (known after apply)
      + node_group_name_prefix = (known after apply)
      ~ release_version        = "1.29.15-20251209" -> (known after apply)
      ~ resources              = [
          - {
              - autoscaling_groups              = [
                  - {
                      - name = "eks-platform-sre-demo-dev-eks-default-b4ce67c8-49b8-f61b-00c3-cfc3c88e0f36"
                    },
                ]
              - remote_access_security_group_id = ""
            },
        ] -> (known after apply)
      ~ status                 = "ACTIVE" -> (known after apply)
        tags                   = {
            "Environment" = "dev"
            "ManagedBy"   = "terraform"
            "Project"     = "platform-sre-demo"
            "Repository"  = "sre-assessment"
        }
      ~ version                = "1.29" -> (known after apply)
        # (9 unchanged attributes hidden)

      ~ update_config {
          - max_unavailable_percentage = 0 -> null
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.platform.module.eks.aws_iam_openid_connect_provider.eks will be updated in-place
  ~ resource "aws_iam_openid_connect_provider" "eks" {
        id              = "arn:aws:iam::936249129410:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/EE58BD1229BE4A6E7F1C1D7735C8FB3C"
        tags            = {
            "Environment" = "dev"
            "ManagedBy"   = "terraform"
            "Project"     = "platform-sre-demo"
            "Repository"  = "sre-assessment"
        }
      ~ thumbprint_list = [
          - "06b25927c42a721631c1efd9431e648fa62e1e39",
        ] -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.platform.module.eks.helm_release.lb_controller[0] will be created
  + resource "helm_release" "lb_controller" {
      + atomic                     = false
      + chart                      = "aws-load-balancer-controller"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "aws-load-balancer-controller"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://aws.github.io/eks-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "1.7.1"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "clusterName"
          + value = "platform-sre-demo-dev-eks"
        }
      + set {
          + name  = "region"
          + value = "us-east-1"
        }
      + set {
          + name  = "serviceAccount.annotations.eks\\.amazonaws\\.com/role-arn"
          + value = "arn:aws:iam::936249129410:role/platform-sre-demo-dev-eks-lb-controller"
        }
      + set {
          + name  = "serviceAccount.create"
          + value = "true"
        }
      + set {
          + name  = "serviceAccount.name"
          + value = "aws-load-balancer-controller"
        }
      + set {
          + name  = "vpcId"
          + value = "vpc-000895d38dda84305"
        }
    }

  # module.platform.module.observability.data.aws_cloudwatch_log_group.eks will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_cloudwatch_log_group" "eks" {
      + arn               = (known after apply)
      + creation_time     = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/eks/platform-sre-demo-dev-eks/cluster"
      + retention_in_days = (known after apply)
      + tags              = (known after apply)
    }

  # module.platform.module.observability.aws_cloudwatch_metric_alarm.node_cpu_high will be created
  + resource "aws_cloudwatch_metric_alarm" "node_cpu_high" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "EKS node CPU utilization exceeds 80% for 15 minutes"
      + alarm_name                            = "platform-sre-demo-dev-node-cpu-high"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "ClusterName" = "platform-sre-demo-dev-eks"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 3
      + id                                    = (known after apply)
      + metric_name                           = "node_cpu_utilization"
      + namespace                             = "ContainerInsights"
      + ok_actions                            = (known after apply)
      + period                                = 300
      + statistic                             = "Average"
      + tags                                  = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "platform-sre-demo"
          + "Repository"  = "sre-assessment"
        }
      + tags_all                              = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "platform-sre-demo"
          + "Repository"  = "sre-assessment"
        }
      + threshold                             = 80
      + treat_missing_data                    = "missing"
    }

  # module.platform.module.observability.aws_cloudwatch_metric_alarm.node_memory_high will be created
  + resource "aws_cloudwatch_metric_alarm" "node_memory_high" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "EKS node memory utilization exceeds 80% for 15 minutes"
      + alarm_name                            = "platform-sre-demo-dev-node-memory-high"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "ClusterName" = "platform-sre-demo-dev-eks"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 3
      + id                                    = (known after apply)
      + metric_name                           = "node_memory_utilization"
      + namespace                             = "ContainerInsights"
      + ok_actions                            = (known after apply)
      + period                                = 300
      + statistic                             = "Average"
      + tags                                  = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "platform-sre-demo"
          + "Repository"  = "sre-assessment"
        }
      + tags_all                              = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "platform-sre-demo"
          + "Repository"  = "sre-assessment"
        }
      + threshold                             = 80
      + treat_missing_data                    = "missing"
    }

  # module.platform.module.observability.aws_cloudwatch_metric_alarm.rds_cpu_high will be created
  + resource "aws_cloudwatch_metric_alarm" "rds_cpu_high" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "RDS CPU utilization exceeds 80% for 15 minutes"
      + alarm_name                            = "platform-sre-demo-dev-rds-cpu-high"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "DBInstanceIdentifier" = "platform-sre-demo-dev-postgres"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 3
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/RDS"
      + ok_actions                            = (known after apply)
      + period                                = 300
      + statistic                             = "Average"
      + tags                                  = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "platform-sre-demo"
          + "Repository"  = "sre-assessment"
        }
      + tags_all                              = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "platform-sre-demo"
          + "Repository"  = "sre-assessment"
        }
      + threshold                             = 80
      + treat_missing_data                    = "missing"
    }

  # module.platform.module.observability.aws_cloudwatch_metric_alarm.rds_storage_low will be created
  + resource "aws_cloudwatch_metric_alarm" "rds_storage_low" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "RDS free storage below 2 GiB"
      + alarm_name                            = "platform-sre-demo-dev-rds-storage-low"
      + arn                                   = (known after apply)
      + comparison_operator                   = "LessThanThreshold"
      + dimensions                            = {
          + "DBInstanceIdentifier" = "platform-sre-demo-dev-postgres"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "FreeStorageSpace"
      + namespace                             = "AWS/RDS"
      + period                                = 300
      + statistic                             = "Average"
      + tags                                  = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "platform-sre-demo"
          + "Repository"  = "sre-assessment"
        }
      + tags_all                              = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "platform-sre-demo"
          + "Repository"  = "sre-assessment"
        }
      + threshold                             = 2147483648
      + treat_missing_data                    = "missing"
    }

  # module.platform.module.observability.aws_kms_key.sns will be created
  + resource "aws_kms_key" "sns" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 7
      + description                        = "KMS key for SNS topic encryption"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + rotation_period_in_days            = (known after apply)
      + tags                               = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "platform-sre-demo"
          + "Repository"  = "sre-assessment"
        }
      + tags_all                           = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "platform-sre-demo"
          + "Repository"  = "sre-assessment"
        }
    }

  # module.platform.module.observability.aws_sns_topic.alerts will be created
  + resource "aws_sns_topic" "alerts" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_throughput_scope       = (known after apply)
      + fifo_topic                  = false
      + id                          = (known after apply)
      + kms_master_key_id           = (known after apply)
      + name                        = "platform-sre-demo-dev-alerts"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + signature_version           = (known after apply)
      + tags                        = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "platform-sre-demo"
          + "Repository"  = "sre-assessment"
        }
      + tags_all                    = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "platform-sre-demo"
          + "Repository"  = "sre-assessment"
        }
      + tracing_config              = (known after apply)
    }

  # module.platform.module.rds.aws_db_instance.this will be created
  + resource "aws_db_instance" "this" {
      + address                               = (known after apply)
      + allocated_storage                     = 20
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = 1
      + backup_target                         = (known after apply)
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + database_insights_mode                = (known after apply)
      + db_name                               = "appdb"
      + db_subnet_group_name                  = "platform-sre-demo-dev-rds"
      + dedicated_log_volume                  = false
      + delete_automated_backups              = true
      + deletion_protection                   = false
      + domain_fqdn                           = (known after apply)
      + endpoint                              = (known after apply)
      + engine                                = "postgres"
      + engine_lifecycle_support              = (known after apply)
      + engine_version                        = "16"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + iam_database_authentication_enabled   = true
      + id                                    = (known after apply)
      + identifier                            = "platform-sre-demo-dev-postgres"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t3.micro"
      + iops                                  = (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + listener_endpoint                     = (known after apply)
      + maintenance_window                    = (known after apply)
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + monitoring_interval                   = 60
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = false
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = (known after apply)
      + password                              = (sensitive value)
      + performance_insights_enabled          = true
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + publicly_accessible                   = false
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_encrypted                     = true
      + storage_throughput                    = (known after apply)
      + storage_type                          = "gp3"
      + tags                                  = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "platform-sre-demo"
          + "Repository"  = "sre-assessment"
        }
      + tags_all                              = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "platform-sre-demo"
          + "Repository"  = "sre-assessment"
        }
      + timezone                              = (known after apply)
      + username                              = "dbadmin"
      + vpc_security_group_ids                = (known after apply)
    }

  # module.platform.module.rds.aws_db_parameter_group.this will be created
  + resource "aws_db_parameter_group" "this" {
      + arn          = (known after apply)
      + description  = "Custom parameter group for platform-sre-demo-dev"
      + family       = "postgres16"
      + id           = (known after apply)
      + name         = (known after apply)
      + name_prefix  = "platform-sre-demo-dev-pg16-"
      + skip_destroy = false
      + tags         = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "platform-sre-demo"
          + "Repository"  = "sre-assessment"
        }
      + tags_all     = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "platform-sre-demo"
          + "Repository"  = "sre-assessment"
        }

      + parameter {
          + apply_method = "immediate"
          + name         = "rds.force_ssl"
          + value        = "1"
        }
    }

  # module.platform.module.rds.aws_db_subnet_group.this will be created
  + resource "aws_db_subnet_group" "this" {
      + arn                     = (known after apply)
      + description             = "Managed by Terraform"
      + id                      = (known after apply)
      + name                    = "platform-sre-demo-dev-rds"
      + name_prefix             = (known after apply)
      + subnet_ids              = [
          + "subnet-0137c5c37c37f4fa2",
          + "subnet-029be1b577312bd30",
        ]
      + supported_network_types = (known after apply)
      + tags                    = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "platform-sre-demo-dev-rds-subnet-group"
          + "Project"     = "platform-sre-demo"
          + "Repository"  = "sre-assessment"
        }
      + tags_all                = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "platform-sre-demo-dev-rds-subnet-group"
          + "Project"     = "platform-sre-demo"
          + "Repository"  = "sre-assessment"
        }
      + vpc_id                  = (known after apply)
    }

  # module.platform.module.rds.aws_iam_role.rds_monitoring will be created
  + resource "aws_iam_role" "rds_monitoring" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "monitoring.rds.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "platform-sre-demo-dev-rds-monitoring"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "platform-sre-demo"
          + "Repository"  = "sre-assessment"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "platform-sre-demo"
          + "Repository"  = "sre-assessment"
        }
      + unique_id             = (known after apply)
    }

  # module.platform.module.rds.aws_iam_role_policy_attachment.rds_monitoring will be created
  + resource "aws_iam_role_policy_attachment" "rds_monitoring" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonRDSEnhancedMonitoringRole"
      + role       = "platform-sre-demo-dev-rds-monitoring"
    }

  # module.platform.module.rds.aws_kms_key.rds will be created
  + resource "aws_kms_key" "rds" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 7
      + description                        = "KMS key for RDS encryption — platform-sre-demo-dev"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + rotation_period_in_days            = (known after apply)
      + tags                               = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "platform-sre-demo"
          + "Repository"  = "sre-assessment"
        }
      + tags_all                           = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "platform-sre-demo"
          + "Repository"  = "sre-assessment"
        }
    }

  # module.platform.module.rds.aws_secretsmanager_secret.db will be created
  + resource "aws_secretsmanager_secret" "db" {
      + arn                            = (known after apply)
      + description                    = "RDS credentials for platform-sre-demo-dev"
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "platform-sre-demo-dev/rds/credentials"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 7
      + tags                           = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "platform-sre-demo"
          + "Repository"  = "sre-assessment"
        }
      + tags_all                       = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "platform-sre-demo"
          + "Repository"  = "sre-assessment"
        }
    }

  # module.platform.module.rds.aws_secretsmanager_secret_version.db will be created
  + resource "aws_secretsmanager_secret_version" "db" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

  # module.platform.module.rds.aws_security_group.rds will be created
  + resource "aws_security_group" "rds" {
      + arn                    = (known after apply)
      + description            = "Allow PostgreSQL access from EKS nodes only"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "platform-sre-demo-dev-rds-sg-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "platform-sre-demo-dev-rds-sg"
          + "Project"     = "platform-sre-demo"
          + "Repository"  = "sre-assessment"
        }
      + tags_all               = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "platform-sre-demo-dev-rds-sg"
          + "Project"     = "platform-sre-demo"
          + "Repository"  = "sre-assessment"
        }
      + vpc_id                 = "vpc-000895d38dda84305"
    }

  # module.platform.module.rds.aws_security_group_rule.rds_ingress[0] will be created
  + resource "aws_security_group_rule" "rds_ingress" {
      + description              = "PostgreSQL from allowed SG 0"
      + from_port                = 5432
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = "sg-040d0de731b0e6650"
      + to_port                  = 5432
      + type                     = "ingress"
    }

  # module.platform.module.rds.random_password.db will be created
  + resource "random_password" "db" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 32
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

Plan: 23 to add, 2 to change, 1 to destroy.

Changes to Outputs:
  + app_url            = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```
*Triggered by @ahalsey in 48e8957b7dd10be5e0f705d4178870dd9cb5b634*